app/Controllers/UserController.php

    public function fetchUsers()
    {
        $users = $this->userModel->findAll();
---
SELECT *
FROM `users`

    public function fetchUser($id)
    {
        $userModel = new UserModel();

        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '76'